# Residency Project Deliverable: 1
# Rutu Shah
# Nischal Joshi
# Murali Krishna
# Santhosh Ramachandran

In [12]:
import pandas as pd

In [14]:
df = pd.read_csv('The Titanic dataset.csv')

In [13]:


#explore the dataset
print("Printing head()\n", df.head())
print("Printing describe()\n", df.describe())
print("Printing info()\n", df.info())

Printing head()
     1       2         3                            4       5    6       7  \
0  sn  pclass  survived                          NaN  gender  age  family
1   1       3         0                  Mr. Anthony    male   42       0
2   1       3         0                  Mr. Anthony    male   42       0
3   2       3         0        Master. Eugene Joseph    male    ?       2
4   3       2         0  Abbott, Mr. Rossmore Edward     NaN  NaN       2

       8         9         10
0   fare  embarked       date
1   7.55       NaN  01-Jan-90
2   7.55       NaN  01-Jan-90
3  20.25         S  02-Jan-90
4     **         S  03-Jan-90
Printing describe()
            1     2     3            4     5     6     7     8     9         10
count   1302  1302  1302         1301  1301  1045  1300  1300  1296       1302
unique  1301     4     3         1297     3    98    10   283     4       1301
top        1     3     0  Mr. Anthony  male    24     0    13     S  01-Jan-90
freq       2   700   801            2   835    47   781    59   905          2
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1302 entries, 0 to 1301
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       1302 non-null   object
 1   2       1302 non-null   object
 2   3       1302 non-null   object
 3   4       1301 non-null   object
 4   5       1301 non-null   object
 5   6       1045 non-null   object
 6   7       1300 non-null   object
 7   8       1300 non-null   object
 8   9       1296 non-null   object
 9   10      1302 non-null   object
dtypes: object(10)
memory usage: 101.8+ KB
Printing info()
 None

In [8]:
# Check for missing values in each column
print(df.isnull().sum())

1       0
2       0
3       0
4       1
5       1
6     257
7       2
8       2
9       6
10      0
dtype: int64